"""
17. Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км.
Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один
одному. Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого
автомобілями; загальний шлях = час · сумарна швидкість.
"""


def main(v1: int, v2: int, s: int, t: int):
    if v1 < 0 or v2 < 0 or s < 0 or t < 0:
        return f'Error'
    else:
        return f'S = {abs(v1 * t + v2 * t - s)}'


if __name__ == '__main__':
    
    v1_ = int(input("V1 = "))
    v2_ = int(input("V2 = "))
    s_ = int(input("S = "))
    t_ = int(input("t = "))

    result = main(v1_, v2_, s_, t_)
    print(result)
